app/controllers/users_controller.rb

  def thankyou
    @user = User.last
---
SELECT "users".* FROM "users" ORDER BY users.id DESC LIMIT 1

  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save
---
INSERT INTO "users" ("first_name", "last_name", "email", "updated_at", "created_at") VALUES ('wetry', 'ewrt', 'martin.hindagfes@mminc.co', '2011-08-23 15:10:04.719230', '2011-08-23 15:10:04.719230')

  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])
---
SELECT "users".* FROM "users" WHERE "users"."id" = 4 LIMIT 1
UPDATE "users" SET "updated_at" = '2011-08-23 17:56:48.811769', "first_name" = 'agdasdf' WHERE "users"."id" = 4